---
kind: method
id: M:Autodesk.Revit.DB.DefinitionBindingMap.Erase(Autodesk.Revit.DB.Definition)
source: html/fbc29ea7-aca2-9979-4acd-cb88c91b2cd9.htm
---
# Autodesk.Revit.DB.DefinitionBindingMap.Erase Method

## Syntax (C#)
```csharp
public virtual int Erase(
	Definition key
)
```

## Parameters
- **key** (`Autodesk.Revit.DB.Definition`)